// algorithm編>9revolution>scripts/data.js
const midasi = ['月', '地球の回り方（南）', '北斗七星', '北斗七星と地球の回り方',
     '地球の回り方（北）', '北斗七星と地球の回り方', '南半球の北', '南半球の北の地球の回り方', 
     '南十字星', '南半球の南の地球の回り方', 'ベクトル', '地球の回転ベクトル',
];
const qands = [
['１．夕方南の方角に見える月は、どの方向に回っていますか。',
'１．右回り（時計回り）', '２．左回り（反時計回り）', '３．ー', '４．ー',　1  ],
['２．南の方角を見ているとき、地球はどの方向に回っていますか。',
'１．右回り（時計回り）','２．左回り（反時計回り）', '３．ー', '４．ー',2 ],
['３．北の空に見える北斗七星はどの方向に回っていますか。', 
'１．右回り（時計回り）', '２．左回り（反時計回り）', '３．ー', '４ー',2  ],
['４．北斗七星の回り方と地球の回り方はどんな関係にありますか。',
'１．南の空の太陽の回り方と地球の回り方の関係と同じ',
 '２．回転しているレコード盤の対称位置にある２点の回り方の関係と同じ', '３．ー', '４．ー',2 ],
['５．北の方角を見ているとき、地球はどの方向に回っていますか。',
'１．右回り（時計回り', '２．左回り（反時計回り）', '３．ー', '４．ー',2  ],
['６．北斗七星の回る向きは地球の自転の向きとどんな関係がありますか。',
'１．回る向きが逆', '２．回る向きが同じ', '３．ー','４．ー', 2 ],
['７．南半球で北の方角を向いているとき、太陽はどこから昇りますか。', 
'１．右側・方角は東', '２．右側・方角は西', '３．左側・方角は東', '４．左側・方角は西',1  ],
['８．南半球で北の方角を向いているとき、地球はどの方向に回っていますか。',
'１．右回り（時計回り）', '２．左回り（反時計回り）', '３．－', '４．－',1 ],
['９．南十字星はどの向きに回っていますか。',
'１．右回り（時計回り）', '２．左回り（反時計回り）','３．ー', '４．ー',1 ],
['１０．南半球で南の空を見ているとき、地球はどの方向に回っていますか。',
'１．右回り（時計回り）', '２．左回り（反時計回り）', '３．ー', '４．ー',1 ],　
['１１．右ねじの進む方向を回転ベクトルとすると、北半球と南半球での地球の回転ベクトルの向きは同じですか。',
 '１．違う', '２．同じ', '３．ー', '４．ー', 2 ],
['１２．地球の回転ベクトルはどの方向を向いていますか。',
 '１．北極から南極へ向かう方向', '２．南極から北極へ向かう方向', '３．ー', '４．ー', 2 ]
];
const seikai = [1, 2, 2, 2, 2, 2, 1, 1, 1, 1, 2, ];