// algorithm編>manabukun>data.js
let midasi = ['', '', '', '', '', '', '', '', '', '',];
let qands = [
    ['１．東京が正午のとき東京より西にある台湾はどの時刻になると考えられますか', 
        '１．14時', '２．13時', '３．12時', '４．11時', 4 ],
    ['２．パリは東京より８時間遅れています。東京が正午のとき、パリは何時ですか',
         '１．２時', '２．３時', '３．４時', '４．５時', 3 ],
    ['３．東京が正午のとき０時の地点はどこですか',
         '１．ロンドン', '２．ブラジル', '３．ニューヨーク', '４．ハワイ',2 ],
    ['４．東京が月曜日の正午のとき、まだ日曜日の都市はどこですか', 
        '１．台北', '２．パリ', '３．ロンドン', '４．ニューヨーク',4 ],
    ['５．日付変更線は西経180度のところにあります。東経何度ですか',
         '１．東経0度', '２．東経90度', '３．東経180度', '４．東経270度',3  ],
    ['６．日付変更線が月曜日の正午のとき、ロンドンはいつの何時ですか',
         '１．月曜日の0時', '２．月曜日の24時', '３．日曜日の0時', '４．日曜日の1時  ',1  ],
    ['７．月曜日の正午に日付変更線を西側から東側へ移動すると、日付はどうなりますか',
         '１．月曜日のまま', '２．日曜日になる', '３．ー', ' ４．ー', 2 ],
    ['８．日曜日の正午に日付変更線を東側から西側へ移動すると、日付はどうなりますか', 
         '１．日曜日のまま', '２．月曜日になる', '３．ー', '４．ー', 2 ],
    ['９．地理的に西側の地点の時刻は現在地の時刻より遅れていますか、進んでいますか', 
         '１．遅れている', '２．進んでいる', '３．ー', '４．ー', 1 ],
    ['１０．地理的に東側の地点の日付は現在地の日付と比べてどうなっていますか', 
         '１．太陽は東から来るので明日の日付になる', '２．日付は変わらない',
         '３．日付は前日の日付になる', '４．ー', 3 ],
];
let seikai = [ 4, 3, 2, 4, 3, 1, 2, 2, 1, 3,];

