// algorithm編>manabukun>data.js
let midasi = ['フムス', '国', '材料', '日本名', '道具', '産地',];
let qands = [
    ['１．フムスとは何ですか', 
        '１．果物', '２．穀物', '３．食べ物', '４．飲み物',3  ],
    ['２．フムスはどこの料理ですか',
         '１．タイ', '２．インド', '３．中東', '４．フランス',3  ],
    ['３．フムスの主な材料は何ですか',
         '１．コメ', '２．マメ', '３．ムギ', '４．肉',2  ],
    ['４．フムスで使われるガルバンゾーとは何ですか', 
        '１．小豆', '２．大豆', '３．ひよこ豆', '４．ソラマメ',3  ],
    ['５．フムスを作るとき使うものは何ですか',
         '１．フードプロセッサー', '２．オーブントースター', 
         '３．電子レンジ', '４．ミキサー',1  ],
    ['６．ひよこ豆の主な産地はどこですか',
         '１．アメリア', '２．インド', '３．中国', '４．日本  ',2  ],
];
let seikai = [3, 3, 2, 3, 1, 2];

