// algorithm編>8howrisethesun>data.js
const midasi = ['太陽の昇るところと方角', '太陽が通る道', '赤道','昼の太陽', 
     '南半球の太陽', '南半球の赤道', '南半球の昼の太陽', '太陽の沈むところ', 
];
const qands = [
['１．南の方角を向いているとき、太陽はどの方向から昇りますか。',
'１．右から昇る・方角は東','２．右から昇る・方角は西', '３．左から昇る・方角は東',
 '４．左から昇る・方角は西',3 ],
['２．太陽は1日で地球のどこを回っていると言えますか。', 
'１．赤道の周りを回っている', '２．北極から南極の方へ回っている', '３．ー', '４ー',1  ],
['３．北半球で赤道はどの方角にありますか。',
'１．東', '２．西', '３．南', '４．北',3 ],
['４．日本では昼、太陽の光はどの方角から来ますか。',
'１．東から', '２．西から', '３．北から', '４．南から',4  ],
['５．南半球で北を向いているとき、太陽はどの方向から昇りますか。',
'１．右から昇る・方角は東', '２．右から昇る・方角は西', '３．左から昇る・方角は東', 
'４．左から昇る・方角は西',1 ],
['６．南半球で赤道はどの方角にありますか。',
'１．東', '２．西','３．南', '４．北',4 ],
['７．タヒチ島では昼、太陽の光はどの方角から来ますか。',
'１．東の方角から', '２．西の方角から', '３．北の方角から', '４．南の方角から',3 ],　
['８．南半球では夕方太陽はどの方角に沈みますか',
'１．東','２．西','３．南','４．北',2],
];
const seikai = [3, 1, 3, 4, 1, 4, 3, 2];
